back/app/controllers/photos_controller.rb

  def create
    @photo = Photo.new(photo_params)

    if @photo.save
---
INSERT INTO "photos" ("order_id", "resource_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 73], ["resource_url", "https://..."], ["created_at", "2020-06-26 04:53:26.376235"], ["updated_at", "2020-06-26 04:53:26.376235"]]

  def update
    if @photo.update(photo_params)
---
UPDATE "photos" SET "resource_url" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["resource_url", "https://..."], ["updated_at", "2020-06-26 04:53:26.432753"], ["id", 11]]

  def destroy
    if @photo.destroy
---
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 16]]

    def set_order
      @order = Order.find(params[:order_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 121], ["LIMIT", 1]]