back2/app/controllers/orders_controller.rb

SELECT COUNT(*) FROM "photos" WHERE "photos"."order_id" = $1  [["order_id", 3]]
---
  def index
    @orders = @orders.map do |order|
      order.attributes.merge(
        photos_number: order.photos.count
      )

INSERT INTO "orders" ("address", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "Apple Valley, CA, USA"], ["latitude", 34.50083110000001], ["longitude", -117.1858759], ["created_at", "2020-06-29 08:28:57.560217"], ["updated_at", "2020-06-29 08:28:57.560217"]]
---
  def create
    @order = Order.new(order_params)

    if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."state" = $1 AND (created_at >= '2020-06-29 00:00:00' AND created_at <= '2020-06-29 23:59:59.999999') AND (address ILIKE 'Apple Valley')  [["state", 0]]
---
    def set_filters
      @orders = Order.where(state: meta_params[:state])

      @orders = @orders.where(
        "created_at >= ? AND created_at <= ?",
        meta_params[:created_at].to_date.beginning_of_day,
        meta_params[:created_at].to_date.end_of_day
      ) if meta_params[:created_at].present?

      @orders = @orders.where(
        "address ILIKE ?",
        "%#{meta_params[:address].downcase}%"
      ) if meta_params[:address].present?